tap "buo/cask-upgrade"
tap "buildpacks/tap"
tap "dopplerhq/cli"
tap "romkatv/powerlevel10k"
tap "sourcemeta/apps"
tap "stripe/stripe-cli"
tap "withgraphite/tap"


# Static checker for GitHub Actions workflow files
brew "actionlint"
# Run your GitHub Actions locally
brew "act"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Official Amazon AWS command-line interface
brew "awscli"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Fish completion for brew-cask
brew "brew-cask-completion"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# CLI for managing secrets through AWS SSM Parameter Store
brew "chamber"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Toll for container signing
brew "cosign"
# Tool for interacting with remote images and registries
brew "crane"
# Tool for testing and debugging Dependabot update jobs
brew "dependabot"
# Lightweight, framework-agnostic database migration tool
brew "dbmate"
# Tools to work with Android .dex and Java .class files
brew "dex2jar"
# Load/unload environment variables based on $PWD
brew "direnv"
# The official Doppler CLI for managing your secrets
brew "dopplerhq/cli/doppler"
# Shared library for Watchman and Eden projects
brew "edencommon"
# EXIF and IPTC metadata manipulation library and tools
brew "exiv2"
# Easiest way to build and release mobile apps
brew "fastlane"
# Thrift functions for querying information from a service
brew "fb303"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Command-line tools for fly.io services
brew "flyctl"
# Command-line fuzzy finder written in Go
brew "fzf"
# Geospatial Data Abstraction Library
brew "gdal"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Highly customizable changelog generator
brew "git-cliff"
# Git extension for versioning large files
brew "git-lfs"
# Core application library for C
brew "glib"
# dot visualization tool
brew "graphviz"
# GNU Privacy Guard, required by Doppler for binary signature verification
brew "gnupg"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# Next generation open source RPC library and framework
brew "grpc"
# Kubernetes package manager
brew "helm"
# Client library for huggingface.co hub
brew "hf"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# C-language implementation of Javascript Object Signing and Encryption
brew "jose"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes Command Line Interface (kubectl)
brew "kubernetes-cli"
# Framework for scientific data networking
brew "libdap"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# X.509 and CMS library
brew "libksba"
# Postgres C API library
brew "libpq"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Scalable, high-performance WebRTC server
brew "livekit"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Run a Kubernetes cluster locally
brew "minikube"
# High Performance, Kubernetes Native Object Storage
brew "minio"
# Client for Minio
brew "minio-mc"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# OCI Registry As Storage
brew "oras"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Web-based viewer for Python profiler output
brew "snakeviz"
# Version control system designed to be a better CVS
brew "subversion"
# Postgres development platform
brew "supabase"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Tool Command Language
brew "tcl-tk", link: false
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Anonymizing overlay network for TCP
brew "tor"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Command-line interface for Vercel
brew "vercel-cli"
# Tool to create, transform and attest VEX metadata
brew "vexctl"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Modular, composable client/server abstractions framework
brew "wangle"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"


# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Stand alone ad blocker
cask "adguard"
# Browse, search and analyse your past AI coding sessions
cask "agentsview"
# Menu bar icon organizer
cask "bartender"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Anthropic's official Claude AI desktop app
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# AI integrated code editor
cask "codex-app"
# AI integrated code editor
cask "cursor"
# API documentation browser and code snippet manager
cask "dash"
# Diagramming app
cask "drawio"
# Launch builds and start simulators from your menu bar
cask "expo-orbit"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Desktop client for GitHub repositories
cask "github"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Web browser
cask "google-chrome"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# CLI for working with JSON Schema
cask "sourcemeta/apps/jsonschema"
# Agent-centric IDE with spec-driven development
cask "kiro"
# App to manage software development and track bugs
cask "linear"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# App wrapper for Postgres
cask "postgres-app"
# Save articles to read, highlight key content, and organise notes for review
cask "reader"
# System wide Slack style Emoji picker
cask "rocket"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Native GUI tool for relational databases
cask "tableplus"
# Open-source code editor
cask "visual-studio-code"
# Adaptive brightness for displays
cask "vivid-app"
# Rust-based terminal
cask "warp"
# Multiplayer code editor
cask "zed"
# OpenJDK distribution from Azul
cask "zulu@17"


# 1Password Safari extension
mas "1Password for Safari", id: 1569813296
# Ad blocker
mas "AdGuard for Safari", id: 1440147259
# Contacts app
mas "Cardhop", id: 1290358394
# Docs and notes editor
mas "Craft", id: 1487937127
# Analyze and recover disk space
mas "DaisyDisk", id: 411643860
# Calendar software
mas "Fantastical", id: 975937182
# Menu Bar system monitoring
mas "iStatistica Pro", id: 1447778660
# Simple JSON viewer for Safari
mas "JSONPeep", id: 1458969831
# Dark Mode for Safari
mas "Noir", id: 1592917505
# Clipboard manager
mas "Paste", id: 967805235
# App wrapper for Redis
mas "Redis Server", id: 972359186
# Save articles from Safari to Readwise Reader
mas "Save to Reader", id: 1640236961
# Slack app
mas "Slack", id: 803453959
# Manage devices on your Tailscale network
mas "Tailscale", id: 1475387142
# Open links in the browser of your choice
mas "Velja", id: 1607635845
# Apple developer IDE
mas "Xcode", id: 497799835
# Apple beta testing app
mas "TestFlight", id: 899247664
# Safari extension to fix YouTube player
mas "Vinegar", id: 1591303229
