tap "adoptopenjdk/openjdk"
tap "buo/cask-upgrade"
tap "edgedb/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "romkatv/powerlevel10k"


# Run your GitHub Actions locally
brew "act"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Official Amazon AWS command-line interface
brew "awscli"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Fish completion for brew-cask
brew "brew-cask-completion"
# CLI for managing secrets through AWS SSM Parameter Store
brew "chamber"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tools to work with Android .dex and Java .class files
brew "dex2jar"
# Load/unload environment variables based on $PWD
brew "direnv"
# Shared library for Watchman and Eden projects
brew "edencommon"
# CLI for the graph-relational database edgedb
brew "edgedb/tap/edgedb-cli"
# EXIF and IPTC metadata manipulation library and tools
brew "exiv2"
# Easiest way to build and release mobile apps
brew "fastlane"
# Thrift functions for querying information from a service
brew "fb303"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Command-line tools for fly.io services
brew "flyctl"
# Command-line fuzzy finder written in Go
brew "fzf"
# Geospatial Data Abstraction Library
brew "gdal"
# Distributed revision control system
brew "git"
# Core application library for C
brew "glib"
# Next generation open source RPC library and framework
brew "grpc"
# Add GitHub support to git on the command-line
brew "hub"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON Schema CLI
brew "jsonschema"
# Framework for scientific data networking
brew "libdap"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# X.509 and CMS library
brew "libksba"
# Postgres C API library
brew "libpq"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python package management tool
brew "poetry"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Software environment for statistical computing
brew "r"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Python 2 and 3 compatibility utilities
brew "six", link: false
# Version control system designed to be a better CVS
brew "subversion"
# Tool Command Language
brew "tcl-tk", link: false
# Tool to build, change, and version infrastructure
brew "terraform"
# Anonymizing overlay network for TCP
brew "tor"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line interface for Vercel
brew "vercel-cli"
# Modular, composable client/server abstractions framework
brew "wangle"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "edgedb/tap/edgedb-cli"
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"


# JDK from the Java User Group (JUG)
cask "adoptopenjdk8"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Stand alone ad blocker
cask "adguard"
# Menu bar icon organizer
cask "bartender"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# API documentation browser and code snippet manager
cask "dash"
# App to build and share containerized applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Desktop debugging platform for mobile developers
cask "flipper"
# Fonts
cask "font-merriweather"
cask "font-merriweather-sans"
cask "font-open-sans"
cask "font-roboto"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App wrapper for Postgres
cask "postgres-unofficial"
# Data science software focusing on R and Python
cask "rstudio"
# Native GUI tool for relational databases
cask "tableplus"
# Utility to hide the notch
cask "topnotch"
# Open-source code editor
cask "visual-studio-code"

# 1Password Safari extension
mas "1Password for Safari", id: 1569813296
# Ad blocker
mas "AdGuard for Safari", id: 1440147259
# Browser management tool
mas "BrowserFairy", id: 1499080593
# Docs and notes editor
mas "Craft", id: 1487937127
# Auto convert websites to dark mode in Safari
mas "Dark Mode for Safari", id: 1397180934
# Analyze and recover disk space
mas "DaisyDisk", id: 411643860
# Calendar software
mas "Fantastical", id: 975937182
# Grammar checker for Safari
mas "Grammarly for Safari", id: 1462114288
# Icon converter
mas "iConvert Icons", id: 515197296
# Read it later servicer
mas "Instapaper", id: 288545208
# Instapaper Safari extension
mas "Instapaper Save", id: 1481302432
# Menu Bar system monitoring
mas "iStatistica", id: 1025822138
# Simple JSON viewer for Safari
mas "JSONPeep", id: 1458969831
# Google Meet Mac app
mas "MeetInOne", id: 1542778639
# Clipboard manager
mas "Paste", id: 967805235
# App wrapper for Redis
mas "Redis Server", id: 972359186
# RSS reader
mas "Reeder", id: 1529448980
mas "Slack", id: 803453959
# Apple developer IDE
mas "Xcode", id: 497799835
# Apple beta testing app
mas "TestFlight", id: 899247664
# Safari extension to fix YouTube player
mas "Vinegar", id: 1591303229
