tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# X.509 and CMS library
brew "libksba"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Software environment for statistical computing
brew "r"
# Persistent key-value database, with built-in net interface
brew "redis"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Version control system designed to be a better CVS
brew "svn"
# Anonymizing overlay network for TCP
brew "tor"
# CLI tool that moves files or folder to the trash
brew "trash"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Menu bar icon organizer
cask "bartender"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# API documentation browser and code snippet manager
cask "dash"
# Pack, ship and run any application as a lightweight container
cask "docker"
# Web browser
cask "firefox"
# Collaborative team software
cask "figma"
# Desktop debugging platform for mobile developers
cask "flipper"
# Fonts
cask "font-merriweather"
cask "font-merriweather-sans"
cask "font-open-sans"
cask "font-source-sans-pro"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Online collaborative whiteboard platform
cask "miro"
# Interactive computing suite
cask "nteract"
# App wrapper for Postgres
cask "postgres-unofficial"
# Collaboration platform for API development
cask "postman"
# Data science software focusing on R and Python
cask "rstudio"
# Native GUI tool for relational databases
cask "tableplus"
# Utility to hide the notch
cask "topnotch"
# Open-source code editor
cask "visual-studio-code"

# Ad blocker
mas "AdGuard for Safari", id: 1440147259
# Browser management tool
mas "BrowserFairy", id: 1499080593
# Docs and notes editor
mas "Craft", id: 1487937127
# Auto convert websites to dark mode in Safari
mas "Dark Mode for Safari", id: 1397180934
# Analyze and recover disk space
mas "DaisyDisk", id: 411643860
# Calendar software
mas "Fantastical", id: 975937182
# Icon converter
mas "iConvert Icons", id: 515197296
# Read it later servicer
mas "Instapaper", id: 288545208
# Instapaper Safari extension
mas "Instapaper Save", id: 1481302432
# App wrapper for Redis
mas "Redis Server", id: 972359186
# RSS reader
mas "Reeder", id: 1529448980
# Todo list software
mas "Things", id: 904280696
# Apple developer IDE
mas "Xcode", id: 1487937127
