akamud.vscode-theme-onedark
akamud.vscode-theme-onelight
alexkrechik.cucumberautocomplete
annsk.alignment
anthropic.claude-code
anysphere.cursorpyright
anysphere.remote-containers
anysphere.remote-ssh
attilabuti.vscode-mjml
bashmish.es6-string-css
bierner.markdown-mermaid
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bradlc.vscode-tailwindcss
charliermarsh.ruff
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
davidlday.languagetool-linter
dbaeumer.vscode-eslint
deerawan.vscode-dash
donjayamanne.typescript-notebook
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
enkia.tokyo-night
equinusocio.vsc-material-theme
esbenp.prettier-vscode
expo.vscode-expo-tools
fabiospampinato.vscode-open-in-github
fabiospampinato.vscode-open-in-npm
firsttris.vscode-jest-runner
formulahendry.auto-rename-tag
frigus02.vscode-sql-tagged-template-literals-syntax-only
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
graphql.vscode-graphql
graphql.vscode-graphql-syntax
hashicorp.terraform
hbenl.vscode-test-explorer
hediet.vscode-drawio
humao.rest-client
lokalise.i18n-ally
lunaryorn.fish-ide
magicstack.edgedb
mariomatheu.syntax-project-pbxproj
mhutchie.git-graph
mikestead.dotenv
monokai.theme-monokai-pro-vscode
mrmlnc.vscode-duplicate
ms-azuretools.vscode-docker
ms-playwright.playwright
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.test-adapter-converter
ms-vscode.vscode-speech
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
msjsdiag.vscode-react-native
openai.chatgpt
orta.vscode-jest
orta.vscode-react-native-storybooks
perkovec.emoji
pflannery.vscode-versionlens
qufiwefefwoyn.inline-sql-syntax
qwtel.sqlite-viewer
redhat.vscode-xml
redhat.vscode-yaml
repreng.csv
ritwickdey.liveserver
ryuta46.multi-command
samuelcolvin.jinjahtml
skyapps.fish-vscode
stkb.rewrap
streetsidesoftware.code-spell-checker
swmansion.react-native-ide
tamasfe.even-better-toml
teabyii.ayu
this-fifo.natty
tobermory.es6-string-html
tomoki1207.pdf
trond-snekvik.simple-rst
uctakeoff.vscode-counter
unifiedjs.vscode-mdx
vitest.explorer
vizzuhq.code-viz-stat
wayou.vscode-todo-highlight
wholroyd.jinja
wix.vscode-import-cost
wmaurer.change-case
yoavbls.pretty-ts-errors
zhouronghui.propertylist
zjcompt.es6-string-javascript
znck.grammarly
